app/controllers/admin/stats_controller.rb

SELECT COUNT(*) FROM "posts"
SELECT COUNT(*) FROM "authors"
SELECT  "posts".* FROM "posts"  ORDER BY "posts"."id" DESC LIMIT 1
---
    def index

        @post_count = Post.count
        @authors_count = Author.count
        @last_post = Post.last